Tekla.Structures.Geometry3d.FacetedBrepFace
The FacetedBrepFace class defines a face of a faceted BREP.
A FacetedBrepFace cannot be instantiated directly. They are managed internally by a FacetedBrep.
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
FacetedBrep brep = SomeFunctionThatReturnFacetedBrep();
foreach (FacetedBrepFace face in brep.Faces)
{
Console.WriteLine("This face has {0} holes", face.Holes.Count);
}
}
}